backend/app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("name", "email", "description", "status", "comments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @ticket = Ticket.new(ticket_params)

    if @ticket.save

UPDATE "tickets" SET "name" = $1, "status" = $2, "comments" = $3, "updated_at" = $4 WHERE "tickets"."id" = $5  [["name", "John Doe"], ["status", "in_progress"], ["comments", "Currently working on the issue."], ["updated_at", "2024-07-15 19:48:17.358868"], ["id", 2]]
---
  def update
    if @ticket.update(ticket_params)